In just ran into this when trying to change the private_dns_name of an endpoint service.
This time OpenTofu was to kind to instruct me to report this as a with the provider:

```
aws_vpc_endpoint_service.gateway: Modifying... [id=vpce-svc-REDACTED_ID]
aws_vpc_endpoint_service.gateway: Still modifying... [id=vpce-svc-REDACTED_ID, 10s elapsed]
aws_vpc_endpoint_service.gateway: Modifications complete after 11s [id=vpce-svc-REDACTED_ID]

│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for aws_route53_record.verify
│ to include new values learned so far during apply, provider
│ "registry.opentofu.org/hashicorp/aws" produced an invalid new value for
│ .name: was cty.StringVal("_OLD_VALIDATION_NAME"), but now
│ cty.StringVal("_NEW_VALIDATION_NAME").
│
│ This is a bug in the provider, which should be reported in the provider's
│ own issue tracker.


│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for
│ aws_route53_record.verify
│ to include new values learned so far during apply, provider
│ "registry.opentofu.org/hashicorp/aws" produced an invalid new value for
│ .records: planned set element cty.StringVal("vpce:REDACTED_ID")
│ does not correlate with any element in actual.
│
│ This is a bug in the provider, which should be reported in the provider's
│ own issue tracker.
```



When looking at the plan:

```
~ update in-place
-/+ destroy and then create replacement
OpenTofu will perform the following actions:
  # aws_route53_record.verify must be replaced
-/+ resource "aws_route53_record" "verify" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_OLD_VALIDATION_NAME.MY_OLD_DOMAIN_NAME" -> (known after apply)
      ~ id                               = "OLD_ZONEID__OLD_VALIDATION_NAME_TXT" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_OLD_VALIDATION_NAME"
      ~ zone_id                          = "OLD_ZONE_ID" -> "NEW_ZONE_ID" # forces replacement
        # (3 unchanged attributes hidden)
    }
  # aws_vpc_endpoint_service.gateway will be updated in-place
  ~ resource "aws_vpc_endpoint_service" "gateway" {
        id                             = "vpce-svc-REDCATED"
      ~ private_dns_name               = "*.MY_OLD_DOMAIN_NAME" -> "*.MY_NEW_DOMAIN_NAME"
        tags                           = {}
        # (16 unchanged attributes hidden)
    }
Plan: 1 to add, 1 to change, 1 to destroy.
```

it's strange that the `name` value of the `aws_route53_record` is NOT expected to change.
But in the TF code itself, this, of course, is a reference, just like all the other values:

```
resource "aws_route53_record" "verify" {
  zone_id = "NEW_ZONE_ID"
  name    = aws_vpc_endpoint_service.gateway.private_dns_name_configuration[0].name
  type    = aws_vpc_endpoint_service.gateway.private_dns_name_configuration[0].type
  ttl     = 60
  records = [aws_vpc_endpoint_service.gateway.private_dns_name_configuration[0].value]
}
```



To complete the report ... after running OpenTofu again a second time, the endpoint resource returned the new value and the route53 verification record was updated properly. So it all boils down to a dependency and refresh issue of this value.
I did a quick look at the provider code, and it seems all those fields are marked as computed:

https://github.com/hashicorp/terraform-provider-aws/blob/871c214dc038286bd983c6704208fc4b72b52dad/internal/service/ec2/vpc_endpoint_service.go#L97-L120




@justinretzolk any chance you could revive the bug hunt on this one?

